ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/supc.h
#define   SUPC_WUIR_WKUPT5_LOW (0x0u << 21) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT5_HIGH (0x1u << 21) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT6 (0x1u << 22) /**< \brief (SUPC_WUIR) Wake-up Input Type 6 */
#define   SUPC_WUIR_WKUPT6_LOW (0x0u << 22) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT6_HIGH (0x1u << 22) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT7 (0x1u << 23) /**< \brief (SUPC_WUIR) Wake-up Input Type 7 */
#define   SUPC_WUIR_WKUPT7_LOW (0x0u << 23) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT7_HIGH (0x1u << 23) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT8 (0x1u << 24) /**< \brief (SUPC_WUIR) Wake-up Input Type 8 */
#define   SUPC_WUIR_WKUPT8_LOW (0x0u << 24) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT8_HIGH (0x1u << 24) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT9 (0x1u << 25) /**< \brief (SUPC_WUIR) Wake-up Input Type 9 */
#define   SUPC_WUIR_WKUPT9_LOW (0x0u << 25) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT9_HIGH (0x1u << 25) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT10 (0x1u << 26) /**< \brief (SUPC_WUIR) Wake-up Input Type 10 */
#define   SUPC_WUIR_WKUPT10_LOW (0x0u << 26) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT10_HIGH (0x1u << 26) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT11 (0x1u << 27) /**< \brief (SUPC_WUIR) Wake-up Input Type 11 */
#define   SUPC_WUIR_WKUPT11_LOW (0x0u << 27) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT11_HIGH (0x1u << 27) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT12 (0x1u << 28) /**< \brief (SUPC_WUIR) Wake-up Input Type 12 */
#define   SUPC_WUIR_WKUPT12_LOW (0x0u << 28) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT12_HIGH (0x1u << 28) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT13 (0x1u << 29) /**< \brief (SUPC_WUIR) Wake-up Input Type 13 */
#define   SUPC_WUIR_WKUPT13_LOW (0x0u << 29) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT13_HIGH (0x1u << 29) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define SUPC_WUIR_WKUPT14 (0x1u << 30) /**< \brief (SUPC_WUIR) Wake-up Input Type 14 */
#define   SUPC_WUIR_WKUPT14_LOW (0x0u << 30) /**< \brief (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
#define   SUPC_WUIR_WKUPT14_HIGH (0x1u << 30) /**< \brief (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. */
/* -------- SUPC_SR : (SUPC Offset: 0x14) Status Register -------- */
#define SUPC_SR_TDOSCSEL (0x1u << 0) /**< \brief (SUPC_SR) Timing Domain 32 kHz Oscillator Selection Status */
#define   SUPC_SR_TDOSCSEL_RC (0x0u << 0) /**< \brief (SUPC_SR) The timing domain slow clock (TD_SLCK) source is the slow RC oscillator output. */
#define   SUPC_SR_TDOSCSEL_XTAL (0x1u << 0) /**< \brief (SUPC_SR) The timing domain slow clock source is the 32.768 kHz crystal oscillator output. */
#define SUPC_SR_IOSMWS (0x1u << 2) /**< \brief (SUPC_SR) VDDIO Supply Monitor Wake-up Status (cleared by reading SUPC_WUSR) */
#define SUPC_SR_CORSMRSTS (0x1u << 3) /**< \brief (SUPC_SR) VDDCORE Supply Monitor Reset Status (cleared by reading SUPC_WUSR) */
#define SUPC_SR_IOSMRSTS (0x1u << 4) /**< \brief (SUPC_SR) VDDIO Supply Monitor Reset Status (cleared by reading SUPC_WUSR) */
#define SUPC_SR_IOSMIS (0x1u << 5) /**< \brief (SUPC_SR) VDDIO Supply Monitor Interrupt Status (cleared by reading SUPC_ISR) */
#define SUPC_SR_IOSMS (0x1u << 6) /**< \brief (SUPC_SR) VDDIO Supply Monitor Output Status */
#define SUPC_SR_LCDS (0x1u << 8) /**< \brief (SUPC_SR) LCD Power Domain Status */
#define SUPC_SR_FWUPS (0x1u << 12) /**< \brief (SUPC_SR) Force Wake-up Pin Status */
#define SUPC_SR_LPDBCS0 (0x1u << 16) /**< \brief (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) */
#define SUPC_SR_LPDBCS1 (0x1u << 17) /**< \brief (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) */
#define SUPC_SR_LPDBCS2 (0x1u << 18) /**< \brief (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) */
#define SUPC_SR_LPDBCS3 (0x1u << 19) /**< \brief (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) */
#define SUPC_SR_LPDBCS4 (0x1u << 20) /**< \brief (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) */
#define SUPC_SR_SXFMS_Pos 24
#define SUPC_SR_SXFMS_Msk (0x3u << SUPC_SR_SXFMS_Pos) /**< \brief (SUPC_SR) Slow Crystal Oscillator Frequency Monitor Status (cleared on read) */
#define   SUPC_SR_SXFMS_GOOD (0x0u << 24) /**< \brief (SUPC_SR) No frequency error detected. */
#define   SUPC_SR_SXFMS_FREQ_ERROR (0x1u << 24) /**< \brief (SUPC_SR) The frequency has not been correct over 4 consecutive monitoring periods but there are still edges detected on the slow crystal oscillator output. */
#define   SUPC_SR_SXFMS_FAIL (0x2u << 24) /**< \brief (SUPC_SR) No edge detected in the slow crystal oscillator output for at least 2 consecutive monitoring periods. */
#define SUPC_SR_SXFME (0x1u << 26) /**< \brief (SUPC_SR) Slow Crystal Oscillator Frequency Monitor Error (cleared on read) */
#define SUPC_SR_WKUPS (0x1u << 27) /**< \brief (SUPC_SR) WKUP Wake-up Status (cleared by reading SUPC_WUSR) */
#define SUPC_SR_BADXTS (0x1u << 28) /**< \brief (SUPC_SR) Slow Crystal Oscillator Wake-up Status (cleared by reading SUPC_WUSR) */
#define SUPC_SR_FWKUPS (0x1u << 29) /**< \brief (SUPC_SR) FWUP Wake-up Status (cleared by reading SUPC_WUSR) */
#define SUPC_SR_RTTS (0x1u << 30) /**< \brief (SUPC_SR) RTT Wake-up Status (cleared by reading SUPC_WUSR) */
#define SUPC_SR_RTCS (0x1u << 31) /**< \brief (SUPC_SR) RTC Wake-up Status (cleared by reading SUPC_WUSR) */
/* -------- SUPC_EMR : (SUPC Offset: 0x1C) Extended Mode Register -------- */
#define SUPC_EMR_FLRSGPBR (0x1u << 16) /**< \brief (SUPC_EMR) Flash Erase GPBR */
#define SUPC_EMR_FULLGPBRC (0x1u << 17) /**< \brief (SUPC_EMR) Full GPBR Clean */
#define SUPC_EMR_COREBGEN (0x1u << 18) /**< \brief (SUPC_EMR) VDDCORE Voltage Regulator Bandgap Enable */
/* -------- SUPC_BMR : (SUPC Offset: 0x20) Backup Mode Register -------- */
#define SUPC_BMR_RTTWKEN (0x1u << 0) /**< \brief (SUPC_BMR) Real-time Timer Wake-up Enable */
#define   SUPC_BMR_RTTWKEN_DISABLE (0x0u << 0) /**< \brief (SUPC_BMR) The RTT alarm signal has no wake-up effect. */
#define   SUPC_BMR_RTTWKEN_ENABLE (0x1u << 0) /**< \brief (SUPC_BMR) The RTT alarm signal forces the wake-up of the core power supply. */
#define SUPC_BMR_RTCWKEN (0x1u << 1) /**< \brief (SUPC_BMR) Real-time Clock Wake-up Enable */
#define   SUPC_BMR_RTCWKEN_DISABLE (0x0u << 1) /**< \brief (SUPC_BMR) The RTC alarm signal has no wake-up effect. */
#define   SUPC_BMR_RTCWKEN_ENABLE (0x1u << 1) /**< \brief (SUPC_BMR) The RTC alarm signal forces the wake-up of the core power supply. */
#define SUPC_BMR_VBATWKEN (0x1u << 2) /**< \brief (SUPC_BMR) VBAT Supply Monitor Wake-up Enable */
#define   SUPC_BMR_VBATWKEN_DISABLE (0x0u << 2) /**< \brief (SUPC_BMR) Wake-up on VBAT supply monitor under voltage detection is disabled. */
#define   SUPC_BMR_VBATWKEN_ENABLE (0x1u << 2) /**< \brief (SUPC_BMR) Wake-up on VBAT supply monitor under voltage detection is enabled. */
#define SUPC_BMR_FWUPEN (0x1u << 4) /**< \brief (SUPC_BMR) Force Wake-up Pin Wake-up Enable */
#define   SUPC_BMR_FWUPEN_DISABLE (0x0u << 4) /**< \brief (SUPC_BMR) The fwup signal has no wake-up effect. */
#define   SUPC_BMR_FWUPEN_ENABLE (0x1u << 4) /**< \brief (SUPC_BMR) The fwup signal forces the wake-up of the core power supply. */
#define SUPC_BMR_CORPORWKEN (0x1u << 5) /**< \brief (SUPC_BMR) VDDCORE POR Wake-up Enable */
#define   SUPC_BMR_CORPORWKEN_DISABLE (0x0u << 5) /**< \brief (SUPC_BMR) Wake-up on VDDCORE Power-On Reset Event is disabled. */
#define   SUPC_BMR_CORPORWKEN_ENABLE (0x1u << 5) /**< \brief (SUPC_BMR) Wake-up on VDDCORE Power-On Reset Event is enabled. */
#define SUPC_BMR_IOSMWKEN (0x1u << 6) /**< \brief (SUPC_BMR) VDDIO Supply Monitor Wake-up Enable */
#define   SUPC_BMR_IOSMWKEN_DISABLE (0x0u << 6) /**< \brief (SUPC_BMR) Wake-up on VDDIO supply monitor under voltage detection is disabled. */
#define   SUPC_BMR_IOSMWKEN_ENABLE (0x1u << 6) /**< \brief (SUPC_BMR) Wake-up on VDDIO supply monitor under voltage detection is enabled. */
#define SUPC_BMR_VBATREN (0x1u << 8) /**< \brief (SUPC_BMR) Battery Voltage Event Report Enable */
#define   SUPC_BMR_VBATREN_DISABLE (0x0u << 8) /**< \brief (SUPC_BMR) Disables the report of event on VBAT voltage. */
#define   SUPC_BMR_VBATREN_ENABLE (0x1u << 8) /**< \brief (SUPC_BMR) Enables the report of event on VBAT voltage. */
#define SUPC_BMR_MRTCOUT (0x1u << 9) /**< \brief (SUPC_BMR) RTCOUT0 Outputs Drive Mode */
#define   SUPC_BMR_MRTCOUT_USERDEF (0x0u << 9) /**< \brief (SUPC_BMR) RTCOUT0 output is driven according to the configuration of the field RTC_MR.OUT0. */
#define SUPC_BMR_BADXTWKEN (0x1u << 10) /**< \brief (SUPC_BMR) Slow Crystal Oscillator Frequency Error Wake-up Enable */
#define SUPC_BMR_KEY_Pos 24
#define SUPC_BMR_KEY_Msk (0xffu << SUPC_BMR_KEY_Pos) /**< \brief (SUPC_BMR) Password Key */
#define SUPC_BMR_KEY(value) ((SUPC_BMR_KEY_Msk & ((value) << SUPC_BMR_KEY_Pos)))
#define   SUPC_BMR_KEY_PASSWD (0xA5u << 24) /**< \brief (SUPC_BMR) Writing any other value in this field aborts the write operation. */
/* -------- SUPC_WUSR : (SUPC Offset: 0x24) Wakeup Status Register -------- */
#define SUPC_WUSR_WKUPS (0x1u << 0) /**< \brief (SUPC_WUSR) WKUP Wake-up Status (cleared on read) */
#define SUPC_WUSR_BADXTWKS (0x1u << 1) /**< \brief (SUPC_WUSR) Slow Crystal Oscillator Frequency Error Wake-up Status (cleared on read) */
#define SUPC_WUSR_FWUPS (0x1u << 2) /**< \brief (SUPC_WUSR) FWUP Wake-up Status (cleared on read) */
#define SUPC_WUSR_IOSMWS (0x1u << 3) /**< \brief (SUPC_WUSR) VDDIO Supply Monitor Wake-up Status (cleared on read) */
#define SUPC_WUSR_RTTS (0x1u << 4) /**< \brief (SUPC_WUSR) RTT Wake-up Status (cleared on read) */
#define SUPC_WUSR_RTCS (0x1u << 5) /**< \brief (SUPC_WUSR) RTC Wake-up Status (cleared on read) */
#define SUPC_WUSR_IOSMRSTS (0x1u << 8) /**< \brief (SUPC_WUSR) VDDIO Supply Monitor Reset Status (cleared on read) */
#define SUPC_WUSR_WKUPIS0 (0x1u << 16) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS1 (0x1u << 17) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS2 (0x1u << 18) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS3 (0x1u << 19) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS4 (0x1u << 20) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS5 (0x1u << 21) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS6 (0x1u << 22) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS7 (0x1u << 23) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS8 (0x1u << 24) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS9 (0x1u << 25) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS10 (0x1u << 26) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS11 (0x1u << 27) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS12 (0x1u << 28) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS13 (0x1u << 29) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS14 (0x1u << 30) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS15 (0x1u << 31) /**< \brief (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) */
/* -------- SUPC_IER : (SUPC Offset: 0x28) Enable Interrupt Register -------- */
#define SUPC_IER_LPDBC0 (0x1u << 0) /**< \brief (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable */
#define SUPC_IER_LPDBC1 (0x1u << 1) /**< \brief (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable */
#define SUPC_IER_LPDBC2 (0x1u << 2) /**< \brief (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable */
#define SUPC_IER_LPDBC3 (0x1u << 3) /**< \brief (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable */
#define SUPC_IER_LPDBC4 (0x1u << 4) /**< \brief (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable */
#define SUPC_IER_IOSMEV (0x1u << 16) /**< \brief (SUPC_IER) VDDIO Supply Monitor Event Interrupt Enable */
#define SUPC_IER_VBATSMEV (0x1u << 17) /**< \brief (SUPC_IER) VBAT Supply Monitor Event Interrupt Enable */
/* -------- SUPC_IDR : (SUPC Offset: 0x2C) Disable Interrupt Register -------- */
#define SUPC_IDR_LPDBC0 (0x1u << 0) /**< \brief (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable */
#define SUPC_IDR_LPDBC1 (0x1u << 1) /**< \brief (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable */
#define SUPC_IDR_LPDBC2 (0x1u << 2) /**< \brief (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable */
#define SUPC_IDR_LPDBC3 (0x1u << 3) /**< \brief (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable */
#define SUPC_IDR_LPDBC4 (0x1u << 4) /**< \brief (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable */
#define SUPC_IDR_IOSMEV (0x1u << 16) /**< \brief (SUPC_IDR) VDDIO Supply Monitor Event Interrupt Disable */
#define SUPC_IDR_VBATSMEV (0x1u << 17) /**< \brief (SUPC_IDR) VBAT Supply Monitor Event Interrupt Disable */
/* -------- SUPC_IMR : (SUPC Offset: 0x30) Mask Interrupt Register -------- */
#define SUPC_IMR_LPDBC0 (0x1u << 0) /**< \brief (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask */
#define SUPC_IMR_LPDBC1 (0x1u << 1) /**< \brief (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask */
#define SUPC_IMR_LPDBC2 (0x1u << 2) /**< \brief (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask */
#define SUPC_IMR_LPDBC3 (0x1u << 3) /**< \brief (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask */
#define SUPC_IMR_LPDBC4 (0x1u << 4) /**< \brief (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask */
#define SUPC_IMR_IOSMEV (0x1u << 16) /**< \brief (SUPC_IMR) VDDIO Supply Monitor Event Interrupt Mask */
#define SUPC_IMR_VBATSMEV (0x1u << 17) /**< \brief (SUPC_IMR) VBAT Supply Monitor Event Interrupt Mask */
/* -------- SUPC_ISR : (SUPC Offset: 0x34) Status Interrupt Register -------- */
#define SUPC_ISR_LPDBC0 (0x1u << 0) /**< \brief (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) */
#define SUPC_ISR_LPDBC1 (0x1u << 1) /**< \brief (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) */
#define SUPC_ISR_LPDBC2 (0x1u << 2) /**< \brief (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) */
#define SUPC_ISR_LPDBC3 (0x1u << 3) /**< \brief (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) */
#define SUPC_ISR_LPDBC4 (0x1u << 4) /**< \brief (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) */
#define SUPC_ISR_IOSMEV (0x1u << 16) /**< \brief (SUPC_ISR) VDDIO Supply Monitor Event Interrupt Status (cleared on read) */
#define SUPC_ISR_VBATSMEV (0x1u << 17) /**< \brief (SUPC_ISR) VBAT Supply Monitor Event Interrupt Status (cleared on read) */

/*@}*/


#endif /* _PIC32CX_SUPC_COMPONENT_ */
